Table of Contents
 Class GrpcService.GrpcServiceBase
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Base class for server-side implementations of GrpcService
[BindServiceMethod(typeof(GrpcService), "BindService")]
public abstract class GrpcService.GrpcServiceBase
Inheritance
object
GrpcService.GrpcServiceBase
Derived
GrpcService
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
public virtual Task ConnectAsync(IAsyncStreamReader<GrpcMessage> requestStream, IServerStreamWriter<GrpcMessage> responseStream, ServerCallContext context)
Parameters
requestStream IAsyncStreamReader<GrpcMessage>
responseStream IServerStreamWriter<GrpcMessage>
context ServerCallContext
Returns
Task
 Edit this page